//Простая программа 
public class FirstSample
{
  public static void main(String[] args)
	{
		System.out.println("We will not use 'Hello, World!'");
	}
}

//коммментарии 
/* Комментарии */

//Типы данных 
  // --Целые числа
	int   i =  4 байт от -2,147483648 до 2147483647
	short s =  2 байт от -32768 до 32767
	long  l =  8 байт от -9223372036854775808L до-9223372036854775807L
	byte  b =  1 байт от-128 до 127
  // --Числа с плавающей точкой 
    float  f =  4 байт	±3.40282347E+38F (6-7 значимых десятичных цифр)
	double d =  8 байт  ±3.40282347E+38F (15 значимых десятичных цифр)

